In [1]:
import pandas as pd

data_dict = {"Name": ["John", "Anna", "Peter"],
             "Age": [28, 24, 33],
             "City": ["New York", "Los Angeles", "Berlin"]}

df = pd.DataFrame(data_dict)

print(df)

"""
    Name  Age         City
0   John   28     New York
1   Anna   24  Los Angeles
2  Peter   33       Berlin
"""

    Name  Age         City
0   John   28     New York
1   Anna   24  Los Angeles
2  Peter   33       Berlin

'\n    Name  Age         City\n0   John   28     New York\n1   Anna   24  Los Angeles\n2  Peter   33       Berlin\n'

### DataFrame Characteristics

In [3]:
print(df.head(1))
print(df.tail(1))

   Name  Age      City
0  John   28  New York
    Name  Age    City
2  Peter   33  Berlin

In [4]:
print(df.shape)

(3, 3)

In [5]:
print(df.dtypes)

Name    object
Age      int64
City    object
dtype: object

### Using Î» (Lambda) for DataFrame Manipulation

In [6]:
print(df.columns)

Index(['Name', 'Age', 'City'], dtype='object')

In [10]:
df['isYouthful'] = df['Age'].apply(lambda age: 'Yes' if age < 30 else 'No')

In [11]:
df

    Name  Age         City isYouthful
0   John   28     New York        Yes
1   Anna   24  Los Angeles        Yes
2  Peter   33       Berlin         No

### The Mighty Concat

In [14]:
df2 = pd.DataFrame({"Name": ["Megan"], "Age": [34], "City": ["San Francisco"], "IsYouthful": ["No"]})

df_concatenated = pd.concat([df, df2], ignore_index=True)

print(df_concatenated)

"""
    Name  Age           City IsYouthful
0   John   28       New York        Yes
1   Anna   24    Los Angeles        Yes
2  Peter   33         Berlin         No
3  Megan   34  San Francisco         No
"""

    Name  Age           City isYouthful IsYouthful
0   John   28       New York        Yes        NaN
1   Anna   24    Los Angeles        Yes        NaN
2  Peter   33         Berlin         No        NaN
3  Megan   34  San Francisco        NaN         No

'\n    Name  Age           City IsYouthful\n0   John   28       New York        Yes\n1   Anna   24    Los Angeles        Yes\n2  Peter   33         Berlin         No\n3  Megan   34  San Francisco         No\n'

In [15]:
df.iloc[1,0] # Select the value in the second row and the first column (1-based)
df.iloc[:2,:2] # Select the first two rows and columns

   Name  Age
0  John   28
1  Anna   24

In [16]:
import pandas as pd
import seaborn as sns

# Load the titanic dataset into a Pandas DataFrame
titanic = sns.load_dataset('titanic')

# Look at the first 3 rows of the DataFrame
print(titanic.head(3))

"""
   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True

[3 rows x 15 columns]
"""

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True

'\n   survived  pclass     sex   age  ...  deck  embark_town  alive  alone\n0         0       3    male  22.0  ...   NaN  Southampton     no  False\n1         1       1  female  38.0  ...     C    Cherbourg    yes  False\n2         1       3  female  26.0  ...   NaN  Southampton    yes   True\n\n[3 rows x 15 columns]\n'

In [28]:
titanic['classBase'] = titanic['class'].apply(lambda clas: 'Yes' if clas == 'First' or clas == 'Third' else 'No')
titanic.head(1)
titanic.tail(9)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,classBase
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True,Yes
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True,No
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True,Yes
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False,Yes
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,No
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,Yes
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,Yes
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,Yes
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,Yes